<?php

namespace Database\Seeders;

use App\Models\Dept;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class DepsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $names = [
            'คณะวิศวกรรมศาสตร์',
            'คณะวิทยาศาสตร์',
            'คณะเทคโนโลยี',
            'คณะสถาปัตยกรรมศาสตร์ ผังเมืองและนฤมิตศิลป์',
            'คณะวิทยาการสารสนเทศ',
            'คณะสิ่งแวดล้อมและทรัพยากรศาสตร์',
            'คณะพยาบาลศาสตร์',
            'คณะเภสัชศาสตร์',
            'คณะสาธารณสุขศาสตร์',
            'คณะแพทยศาสตร์',
            'คณะสัตวแพทยศาสตร์',
            'คณะมนุษยศาสตร์และสังคมศาสตร์',
            'คณะศึกษาศาสตร์',
            'คณะการบัญชีและการจัดการ',
            'คณะศิลปกรรมศาสตร์และวัฒนธรรมศาสตร์',
            'คณะการท่องเที่ยวและการโรงแรม',
            'วิทยาลัยการเมืองการปกครอง',
            'วิทยาลัยดุริยางคศิลป์',
            'คณะนิติศาสตร์',
            'สถาบันวิจัยวลัยรุกขเวช',
            'โรงเรียนสาธิตมหาวิทยาลัยมหาสารคาม (ฝ่ายประถม)',
            'โรงเรียนสาธิตมหาวิทยาลัยมหาสารคาม (ฝ่ายมัธยม)',
            'บัณฑิตวิทยาลัย',
            'สำนักศึกษาทั่วไป',
            'สถาบันวิจัยศิลปะและวัฒนธรรมอีสาน',
            'สำนักคอมพิวเตอร์',
            'สำนักวิทยบริการ',
            'กองกลาง',
            'กองแผนงาน',
            'กองการเจ้าหน้าที่',
            'กองกิจการนิสิต',
            'กองคลังและพัสดุ',
            'กองบริการการศึกษา',
            'กองทะเบียนและประมวลผล',
            'กองอาคารสถานที่',
            'กองส่งเสริมการวิจัยและบริการวิชาการ',
            'กองประชาสัมพันธ์และกิจการต่างประเทศ',
            'ศูนย์วิจัยและการศึกษาบรรพชีวินวิทยา',
            'สำนักบริการวิชาการ',
            'ศูนย์ความเป็นเลิศทางนวัตกรรมไหม',
            'ศูนย์ความร่วมมือกับภาคอุตสาหกรรม (UIC)',
            'ศูนย์เครื่องมือกลางมหาวิทยาลัยมหาสารคาม',
            'ฟาร์มมหาวิทยาลัยมหาสารคาม',
            'พิพิธภัณฑ์มหาวิทยาลัยมหาสารคาม',
            'โครงการอนุรักษ์เอกสารใบลานในภาคตะวันออกเฉียงเหนือ',
            'โครงการอนุรักษ์พันธุกรรมพืชฯ',
            'สมาคมศิษย์เก่า',
            'สหกรณ์ออมทรัพย์มหาวิทยาลัยศรีนครินทรวิโรฒ จำกัด',
            'สหกรณ์ออมทรัพย์มหาวิทยาลัยมหาสารคาม',
        ];

        foreach ($names as $name) {
            Dept::firstOrCreate(['name' => $name]);
        }
    }
}
